# data types Date:6-5-22

In [4]:
x=12
type(x)

int

In [2]:
y=12.3
type(y)

float

In [5]:
x=1+2j
type(x)

complex

In [12]:
x=12
a=float(x)
print(type(a))
a

<class 'float'>

12.0

In [10]:
x=12.4
b=int(x)
b

12

In [15]:
#operators
x=28+2.3
print(x)
type(x)

30.3

float

In [17]:
a=35
b=4.8
sum=a+int(b)
print(sum)

39

In [43]:
#unary opeartors
x=55
print(-x)
print(+x)
print(~x)
#Arthematic operators
print("Arithmatic operators")
x=20
y=4
print("x+y=",x+y)
print("x-y=",x-y)
print("x*y=",x*y)
print("x/y=",x/y)
print("x//y=",x//y)
print("x%y=",x%y)
print("x**y=",x**y)
#comparison operators
print("comparison operators")
a=10
b=20
print(a<b)
print(a>b)
print(a<=b)
print(a>=b)
print(a==b)
print(a!=b)

-55
55
-56
Arithmatic operators
x+y= 24
x-y= 16
x*y= 80
x/y= 5.0
x//y= 5
x%y= 0
x**y= 160000
comparison operators
True
False
True
False
False
True

In [50]:
#bitwise operators 
print("bitwise operators")
p=10
q=3
r=10
print("p&q=",p&q)
print("p|q=",p|q)
print("~p=",~p)
#logical operators
x=(45==6)
y=(6>4)
a=x and y
b=x or y
c=not x
d=not y
print(a)
print(b)
print(c)
print(d)

bitwise operators
p&q= 2
p|q= 11
~p= -11
False
True
True
False

In [65]:
#expressions
a=5+8+9*(3-1)
print(a)
b=(20/5)-3+8*5
print(b)
c=60-40+30*4+(3+6)
print(c)
#combinational expressions
print("combinational exp")
a=34
b=24
c=a+(b>>1)
print(c)
x=(a<<1)+(b<<1)
print(x)

31
41.0
149
combinational exp
46
116

In [69]:
a=10
b=4
a//b
a/b

2.5

In [73]:
#variables
a=10
b=20
print(a)
print(b)
print("----")
a,b,c=20,30,40
print(a)
print(b)
print(c)
print("---")
x=str(3)
y=int(3)
z=float(3)
print(x)
print(y)
print(z)

10
20
----
20
30
40
---
3
3
3.0

# string operations Date:9-5-22

it is a sequence of elements and characters
immutable,changeble,ordered,allow duplicate values

In [149]:
x=" Ammani is good girl good"
y="Sravani"
z="swami"
a="teacher123"
print(x)
print(x.upper())
print(x.lower())
print(len(x))
print(x.capitalize())
print(x.isalpha())
print(x.isdigit())
print(x.count("m"))
print(y.istitle())
print(x.partition("is"))
print(y.join(z))
print(x.replace("good","bad"))
print(x.split())
print(x.swapcase())
print(max(x))
print(min(z))
print(a.isalnum())
print(x.strip())
print(x.casefold())
print(x.encode())
print(x.find("m"))

 Ammani is good girl good
 AMMANI IS GOOD GIRL GOOD
 ammani is good girl good
25
 ammani is good girl good
False
False
2
True
(' Ammani ', 'is', ' good girl good')
sSravaniwSravaniaSravanimSravanii
 Ammani is bad girl bad
['Ammani', 'is', 'good', 'girl', 'good']
 aMMANI IS GOOD GIRL GOOD
s
a
True
Ammani is good girl good
 ammani is good girl good
b' Ammani is good girl good'
2

# list operations Date:18-5-22

list is collection of elements
mutable,changeable,ordered,allow to duplicate values

In [225]:
l1=[1,2,3,4,5,3,2]
l2=[10,20,30,40,50]
print(l1)
print(len(l1))
concatenate=l1+l2
print(concatenate)
replace=l1[2]=5
print(l1)
l2.index(30)
x=l1.insert(2,10)
l1
print(l1.pop())
print(l1.pop(2))
print(max(l1))
print(min(l2))
extend=l1.extend(l2)
print(l1)
print(l1.count(5))
l1.reverse()
print(l1)
l1.append(9)
print(l1)
l1.sort()
print(l1)
l1.remove(9)
print(l1)
l2.copy()
print(l2)

[1, 2, 3, 4, 5, 3, 2]
7
[1, 2, 3, 4, 5, 3, 2, 10, 20, 30, 40, 50]
[1, 2, 5, 4, 5, 3, 2]
2
10
5
10
[1, 2, 5, 4, 5, 3, 10, 20, 30, 40, 50]
2
[50, 40, 30, 20, 10, 3, 5, 4, 5, 2, 1]
[50, 40, 30, 20, 10, 3, 5, 4, 5, 2, 1, 9]
[1, 2, 3, 4, 5, 5, 9, 10, 20, 30, 40, 50]
[1, 2, 3, 4, 5, 5, 10, 20, 30, 40, 50]
[10, 20, 30, 40, 50]

In [237]:
#slicing in lists
l=[1,2,3,4,5,6,7,8,9]
l[2:5]
l[:5]
l[2:]
print(l[3:3])
l[:-2]
l[0:-4]
l[-2:2]
l[:]
l[::2]
l[::3]

[]

[1, 4, 7]

# Tuple operations Date:18-5-22

tuple is used to store the multiple items in a single variable
immutable,unchangeble,ordered,allow duplicates

In [39]:
t=(1,2,3,5)
t1=[10,20,30,40]
print(t)
print(max(t))
print(min(t))
print(sum(t))
print(all(t))
print(any(t))
print(list(reversed(t)))
print(sorted(t))
print(t.index(3))
print(t.count(2))
print(len(t))
print(t[0:2])
t1=(10,20,30,40)
t2=(60,80,70)
print(t1+t2)
print(30 in t1)
print(90 in t2)
t3=t2,(100,90)
print(t3)

(1, 2, 3, 5)
5
1
11
True
True
[5, 3, 2, 1]
[1, 2, 3, 5]
2
1
4
(1, 2)
(10, 20, 30, 40, 60, 80, 70)
True
False
((60, 80, 70), (100, 90))

# sets Date:17-5-22

sets is used to store the multiple items in a single variable
mutable,changeble,unorderd,not allowed duplicates,{},  ,

In [100]:
s={1,2,3,4}
print(s)
print(len(s))
print(max(s))
print(min(s))
print(sum(s))
print(sorted(s))
s.add(10)
print(s)
s.update([20,30,],[40,50])
print(s)
s.discard(50)
print(s)
s.remove(40)
print(s)
s.pop()
print(s)
s.clear()
print(s)
s1={10,20,30,40,80}
s2={50,60,70,80,90}
print(s1.union(s2))
print(s1.intersection(s2))
print(s1.difference(s2))
print(s1.symmetric_difference(s2))
print(s1.difference_update(s2))
x=s2.copy()
print(x)
print(s1.isdisjoint(s2))
s1={1,2,3,4,5}
s2={1,2,3,4,10,20,30,5}
print(s1.isdisjoint(s2))
print(s1.issubset(s2))
print(s2.issuperset(s1))

{1, 2, 3, 4}
4
4
1
10
[1, 2, 3, 4]
{1, 2, 3, 4, 10}
{1, 2, 3, 4, 40, 10, 50, 20, 30}
{1, 2, 3, 4, 40, 10, 20, 30}
{1, 2, 3, 4, 10, 20, 30}
{2, 3, 4, 10, 20, 30}
set()
{70, 40, 10, 80, 50, 20, 90, 60, 30}
{80}
{40, 10, 20, 30}
{70, 10, 20, 90, 30, 40, 50, 60}
None
{80, 50, 70, 90, 60}
True
False
True
True

# Dictionaries Date:17-5-22

it is a sequence of items
mutable,changeble,orderd,not allow duplicates,{}, ,

In [54]:
d={1:"a",2:"b",3:"c",4:"d",5:"e"}
print(d)
print(type(d))
print(len(d))
print(d.items())
print(d.keys())
print(d.values())
x=d.copy()
print(x)
print(d.copy())
print(d.get(4))
print(d[2])
d[2]=8
print(d)
d[3]="z"
print(d)
d.update({"w":10})
print(d)
d.pop("w")
print(d)
d.popitem()
print(d)
d.clear()
print(d)
x={"a","b","c"}
y=4
d=dict.fromkeys(x,y)
print(d)
d

{1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'}
<class 'dict'>
5
dict_items([(1, 'a'), (2, 'b'), (3, 'c'), (4, 'd'), (5, 'e')])
dict_keys([1, 2, 3, 4, 5])
dict_values(['a', 'b', 'c', 'd', 'e'])
{1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'}
{1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'}
d
b
{1: 'a', 2: 8, 3: 'c', 4: 'd', 5: 'e'}
{1: 'a', 2: 8, 3: 'z', 4: 'd', 5: 'e'}
{1: 'a', 2: 8, 3: 'z', 4: 'd', 5: 'e', 'w': 10}
{1: 'a', 2: 8, 3: 'z', 4: 'd', 5: 'e'}
{1: 'a', 2: 8, 3: 'z', 4: 'd'}
{}
{'c': 4, 'b': 4, 'a': 4}

{'c': 4, 'b': 4, 'a': 4}

# Conditions & Branching Date:16-5-22

conditions evaluted and processed as true or false
if,if-else,elif,nested  if else

In [68]:
#number is positive or negative
n=int(input("Enter the number"))
if n>0:
    print("number is a positive number")
elif n==0:
    print("number is zero")
else:
    print("number is negative")
    
#given number is even or not
n=int(input("Enter the number"))
if n%2==0:
    print("number is even")
else:
     print("number is odd")

Enter the number-3
number is negative
Enter the number3
number is odd

In [75]:
#leap year or not
n=int(input("Enter the number"))
if n%4==0:
    if n%100==0:
        if n%400==0:
            print(n,"is leap year")
        else:
            print(n,"is not leap year")
    else:
         print(n,"is leap year")
else:
    print(n,"year is not leap year")

Enter the number2000
2000 is leap year

In [77]:
#grater element among three numbers
a=int(input("Enter first numbers"))
b=int(input("Enter secound numbers"))
c=int(input("Enter third numbers"))
if(a>b&a>c):
    print("a is big")
elif(b>a&b>c):
    print("b is big")
else:
    print("c is big")

Enter first numbers10
Enter secound numbers20
Enter third numbers30
c is big

In [87]:
#loops
#print numbers from 1 to 10 and 10 to 1
print("numbers from 1 to 10:")
for i in range(1,11,1):
    print(i)
print("numbers from 10 to 1")
for i in range(10,0,-1):
    print(i)

numbers from 1 to 10:
1
2
3
4
5
6
7
8
9
10
numbers from 10 to 1
10
9
8
7
6
5
4
3
2
1

In [96]:
#even and odd numbers upto 100
print("even numbers upto 10")
for i in range(2,11,2):
    print(i)
print("odd numbers upto 100")
for i in range(1,11,2):
    print(i)

even numbers upto 10
2
4
6
8
10
odd numbers upto 100
1
3
5
7
9

In [102]:
#print sum of n numbers
n=int(input("Enter the numbers"))
temp=0
for i in range(1,n+1,1):
    temp+=i
print(temp)

Enter the numbers4
10

In [106]:
#factorial numbers
n=int(input("Enter the numbers"))
temp=1
for i in range(1,n+1,1):
    temp*=i
print(temp)

Enter the numbers5
120

In [107]:
#print sum of squres of the n numbers
n=int(input("Enter a number"))
temp=0
for i in range(1,n+1):
    temp+=i*i
print(temp)

Enter a number4
30

In [116]:
#number is prime or not
n=int(input("Enter the number"))
count=0
if n>1:
    for i in range(2,n+1):
        if(n%2)==0:
            count=1
            break
if count==1:
    print("it is not prime",n)
else:
    print("it is prime",n)

Enter the number9
it is prime 9

In [119]:
#prime numbers between some intervals
a=int(input("Enter the starting range"))
b=int(input("Enter the ending range"))
print("renge between the numbers a to b")
if n>1:
    for i in range(2,i):
        if(n%i)==0:
            break
    else:
        print(i)

Enter the starting range2
Enter the ending range10
renge between the numbers a to b
2

In [126]:
#programe to check the coprime or not
a=int(input("Enter the first numbers"))
b=int(input("Enter the secound numbers"))
x=min(a,b)
for i in range(1,x+1):
    if a%i==0 and b%i==0:
        hcf=i
if hcf==1:
    print(a,b,"are coprime numbers") 
else:
    print(a,b,"are not coprime")

Enter the first numbers3
Enter the secound numbers8
3 8 are coprime numbers

In [129]:
#fibonocii numbers
n=int(input("Enter a number"))
a=0
b=1
print(a)
print(b)
for i in range(0,n,1):
    s=a+b
    a=b
    b=s
    print(s)

Enter a number10
0
1
1
2
3
5
8
13
21
34
55
89

In [137]:
#branching statements
#break
for i in range(1,10):
    if i==5:
        break
    print(i)

1
2
3
4

In [ ]:
#continue
for i in range(1,10):
    if i==4:
        continue
    print(i)

In [139]:
#return \
def fun1():
    x=10
    return x
def fun2():
    y=123
    return y
print(fun1())
print(fun2())

10
123

# Objects & Classes Date:14-5-22

object is defined a group of objects that share common properties and behavior like car is class model,wheels price etc
it is userdefined blueprint of class
objects are derived from the class

In [151]:
class myclass:
      def func(self):
        print("hello world")
        
x=myclass()
x.func()

hello world

In [166]:
class student:
    def __init__(self,name):
        self.name=name
    def display(self):
        print(self.name)
    def func(self):
        print("welcome")
x=student("ammani")
x.display()
x.name
x.func()

ammani
welcome

In [170]:
class student:
    def __init__(self,name,rollno):
        self.name=name
        self.rollno=rollno
    def display(self):
        print(self.name)
        print(self.rollno)
s1=student("ammani",204)
s1.display()
s2=student("sravani",234)
s2.display()

ammani
204
sravani
234

In [175]:
class dog:
    attr1="cat"
    attr2="dog"
    def func(self):
        print("i am a",self.attr1)
        print("i am a",self.attr2)
x=dog()
print(x.attr1)
x.func()

cat
i am a cat
i am a dog

# unit2
# file handlinding  Date:13-5-2022

In [2]:
f=open("file.txt")
f.close()

In [5]:
f=open("file.txt","r")
print(f.read())
f.close()

Sravani Is Good girl 2003 @12
this is ammani

In [7]:
f=open("file.txt","r")
print(f.read(10))
f.close()

Sravani Is

In [8]:
f=open("file.txt","r")
print(f.readline())
f.close()

Sravani Is Good girl 2003 @12

In [9]:
f=open("file.txt","r")
print(f.readline())
print(f.readline())
f.close()

Sravani Is Good girl 2003 @12

this is ammani

In [10]:
f=open("file.txt","a")
f.write("sravni is bad girl")
f.close()

In [12]:
f=open("file.txt","r")
print(f.read())
f.close()

Sravani Is Good girl 2003 @12
this is ammani
sravni is bad girl

# Regular Expressions  (14-5-22)

1.to extract the information to text,"re" is the module it is a collection of predefined functions,to check the if pattern contains the specifies string
match():to test the input string starts with specified pattern or not
search():to test the specified pattern is present are not in given input
find():to find duplicates for specified pattern
split():how to split the input string ,sub():replace the substring,compile():used to create pattern object and can be re-used

In [27]:
#find all produce the no of occernces characters in txt if not available get empty string
import re
txt="i am ammani poluparthi"
x=re.findall("a",txt)
print(x)

['a', 'a', 'a', 'a']

In [28]:
#search to find txt is matched or not it matched it gives match object else null
import re
txt="i am ammani poluparthi"
x=re.search("amma",txt)
print(x)

<re.Match object; span=(5, 9), match='amma'>

In [31]:
#match obeject types
#index no
print(x.start())
#gives range
print(x.span())
print(x.string)
print(x.group())

5
(5, 9)
i am ammani poluparthi
amma

In [14]:
import re
txt="i am ammani poluparthi"
x=re.split("ammani",txt)
y=re.split("",txt)
print(x)
print(y)

['i am ', ' poluparthi']
['', 'i', ' ', 'a', 'm', ' ', 'a', 'm', 'm', 'a', 'n', 'i', ' ', 'p', 'o', 'l', 'u', 'p', 'a', 'r', 't', 'h', 'i', '']

In [15]:
#sub() is replace
import re
txt="i am ammani poluparthi"
x=re.sub("ammani","sravani",txt)
print(x)

i am sravani poluparthi

# Pandas  Date:13-6-2022

1.it is a open souece library that provides high performance data manipulation in python
2.it is working on data sets,it is fast and flexible data structures designed to make working with relational or labeled data and it efficiencly handles large data
3.mainly pandas is used to analyze the data

In [2]:
import pandas as pd
df=pd.read_csv("pandas.csv")
df

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [3]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [4]:
df.head()

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600

In [5]:
df.tail()

   Unnamed: 0    Name  Age  Salary
4           4     Anu   16    1600
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9 non-null      int64
 1   Name        9 non-null      object
 2   Age         9 non-null      int64
 3   Salary      9 non-null      int64
dtypes: int64(3), object(1)
memory usage: 416.0+ bytes

In [7]:
df[["Name","Age"]]

      Name  Age
0    Bhanu   18
1  Sravani   17
2     Rani   20
3   Pavani   19
4      Anu   16
5    Kavya   25
6   Monika   26
7   Bhavya   22
8   Manasa   30

In [8]:
df["Age"]>18

0    False
1    False
2     True
3     True
4    False
5     True
6     True
7     True
8     True
Name: Age, dtype: bool

In [13]:
print(df["Age"].max())
print(df["Age"].min())
print(df["Age"].sum())
print(df["Age"].mean())
print(df["Age"].median())
print(df["Age"].mode())

30
16
193
21.444444444444443
20.0
0    16
1    17
2    18
3    19
4    20
5    22
6    25
7    26
8    30
dtype: int64

In [14]:
df.Age.describe()

count     9.000000
mean     21.444444
std       4.693376
min      16.000000
25%      18.000000
50%      20.000000
75%      25.000000
max      30.000000
Name: Age, dtype: float64

In [29]:
print(df.loc[1])

Unnamed: 0          1
Name          Sravani
Age                 2
Salary            100
Name: 1, dtype: object

In [30]:
df

   Unnamed: 0     Name Age  Salary
0           0    Bhanu   1     100
1           1  Sravani   2     100
2           2     Rani   3     100
3           3   Pavani   4     100
4           4      Anu   5     100
5           5    Kavya   6     100
6           6   Monika   7     100
7           7   Bhavya   8     100
8           8   Manasa   9     100

In [31]:
df['Age']=["1","2","3","4","5","6","7","8","9"]
df

   Unnamed: 0     Name Age  Salary
0           0    Bhanu   1     100
1           1  Sravani   2     100
2           2     Rani   3     100
3           3   Pavani   4     100
4           4      Anu   5     100
5           5    Kavya   6     100
6           6   Monika   7     100
7           7   Bhavya   8     100
8           8   Manasa   9     100

In [32]:
df["Salary"]=100
df

   Unnamed: 0     Name Age  Salary
0           0    Bhanu   1     100
1           1  Sravani   2     100
2           2     Rani   3     100
3           3   Pavani   4     100
4           4      Anu   5     100
5           5    Kavya   6     100
6           6   Monika   7     100
7           7   Bhavya   8     100
8           8   Manasa   9     100

In [34]:
df.loc[2,"Name"]

'Rani'

In [35]:
df.loc[2,"Age"]

'3'

In [40]:
import pandas as pd
data=pd.read_csv("pandas.csv")
newdata=data[(data.Age>20)&(data.Salary>100)]
newdata

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [53]:
import pandas as pd
x=pd.Series([1,2,3,4,5,6])
print(x)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [58]:
print(x.values)
print(x.shape)
print(x.size)
print(x.ndim)
print(x.nbytes)
print(x.empty)

[1 2 3 4 5 6]
(6,)
6
1
48
False

In [66]:
df["id no"]=[204,205,355,842,112,456,234,678,111]
df

   Unnamed: 0    Name Age  Salary  id no
0           0  Ammani   1     100    204
1           1  Ammani   2     100    205
2           2  Ammani   3     100    355
3           3  Pavani   4     100    842
4           4     Anu   5     100    112
5           5   Kavya   6     100    456
6           6  Monika   7     100    234
7           7  Bhavya   8     100    678
8           8  Manasa   9     100    111

In [70]:
d={
    "a":[10,20,30],
    "b":[1,2,3],
    "c":[11,12,13]
}
x=pd.DataFrame(d)
print(x)

    a  b   c
0  10  1  11
1  20  2  12
2  30  3  13

# Numpy

1.numpy as numerical python
2.it is a python library used for working with arrays

In [ ]:
import numpy as np